---
kind: type
id: T:Autodesk.Revit.DB.SynchronizeWithCentralOptions
source: html/96eaf3af-971d-da6d-a857-88d6e602ffd4.htm
---
# Autodesk.Revit.DB.SynchronizeWithCentralOptions

Options to control behavior of synchronization with central.

## Syntax (C#)
```csharp
public class SynchronizeWithCentralOptions : IDisposable
```